In [1]:
import pandas as pd
import numpy as np

In [10]:
df = pd.read_csv("datasets/records.csv")

In [11]:
df

   ID    Name    Role  Salary
0   1  Pankaj  Editor   10000
1   2    Lisa  Editor    8000
2   3   David  Author    6000
3   4     Ram  Author    4000
4   5  Anupam  Author    5000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   Name    5 non-null      object
 2   Role    5 non-null      object
 3   Salary  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [13]:
# filling missing values - IMPUTATION
data = df
data['Salary'] = data['Salary'].fillna(data['Salary'].mean())

data

   ID    Name    Role  Salary
0   1  Pankaj  Editor   10000
1   2    Lisa  Editor    8000
2   3   David  Author    6000
3   4     Ram  Author    4000
4   5  Anupam  Author    5000

In [14]:
# Imputation with additional column
data = df
data['SalaryMissing'] = data['Salary'].isnull()

data

   ID    Name    Role  Salary  SalaryMissing
0   1  Pankaj  Editor   10000          False
1   2    Lisa  Editor    8000          False
2   3   David  Author    6000          False
3   4     Ram  Author    4000          False
4   5  Anupam  Author    5000          False

In [17]:
# regression model
testdf = df[df['Salary'].isnull()==True]
traindf = df[df['Salary'].isnull()==False]
traindf.drop("Salary",axis=1,inplace = True)
testdf.drop("Salary",axis=1,inplace = True)

C:\Users\kirte\AppData\Local\Temp\ipykernel_944\1290719130.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  testdf.drop("Salary",axis=1,inplace = True)

In [18]:
traindf

   ID    Name    Role  SalaryMissing
0   1  Pankaj  Editor          False
1   2    Lisa  Editor          False
2   3   David  Author          False
3   4     Ram  Author          False
4   5  Anupam  Author          False